adafruit/circuitpython/ports/raspberrypi/boards/waveshare_rp2350_usb/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2021 Scott Shawcroft for Adafruit Industries
// SPDX-FileCopyrightText: Copyright (c) 2024 Cooper Dalrymple
//
// SPDX-License-Identifier: MIT

#pragma once

#define MICROPY_HW_BOARD_NAME "Waveshare RP2350-USB-A"
#define MICROPY_HW_MCU_NAME "rp2350"

#define MICROPY_HW_NEOPIXEL (&pin_GPIO16)

#define CIRCUITPY_USB_HOST_INSTANCE 1
